Vadimatorik/module_stm32f2_low_level_by_st/interfaces/inc/timer.h
#pragma once

#include "mc_hardware_interfaces_timer.h"
#include "stm32f2xx_hal_tim.h"
#include "stm32f2xx_hal_rcc.h"

struct clkTimBaseCfg {
	const uint16_t					period;					// 0..0xFFFF.
	const uint16_t					prescaler;				// 0..0xFFFF.

	/// Используется только в:
	/// 1. timCompOneChannelCfg
	const uint16_t					pulse;					// 0..0xFFFF.
};

struct timCompOneChannelCfg {
	// Используемый таймер.
	TIM_TypeDef*					tim;

	const clkTimBaseCfg*			const cfg;
	uint32_t						countCfg;

	// Параметры выходного канала.
	uint8_t							outChannel;		// TIM_CHANNEL_x.
	uint32_t						polarity;		// TIM_OCPOLARITY_LOW  / TIM_OCPOLARITY_HIGH.

};

class TimCompOneChannel : public TimCompOneChannelBase {
public:
	TimCompOneChannel( const timCompOneChannelCfg* const cfg );

	BASE_RESULT		reinit					( uint32_t numberCfg = 0 );

	BASE_RESULT		on						( void );
	void			off						( void );

private:
	const timCompOneChannelCfg*		const cfg;

	TIM_HandleTypeDef				tim;
	TIM_OC_InitTypeDef				timCh;
};

struct timPwmOneChannelCfg {
	// Используемый таймер.
	TIM_TypeDef*					tim;

	const clkTimBaseCfg*			const cfg;
	uint32_t						countCfg;

	// Параметры выходного канала.
	uint8_t							outChannel;			// TIM_CHANNEL_x.
	uint32_t						polarity;			// TIM_OCPOLARITY_LOW  / TIM_OCPOLARITY_HIGH.
};

class TimPwmOneChannel : public TimPwmOneChannelBase {
public:
	TimPwmOneChannel( const timPwmOneChannelCfg* const cfg );

	BASE_RESULT		reinit					( uint32_t numberCfg = 0 );

	BASE_RESULT		on						( void );
	void			off						( void );

	void			setDuty					( float duty );

private:
	const timPwmOneChannelCfg*		const cfg;

	TIM_HandleTypeDef				tim;
	TIM_OC_InitTypeDef				timCh;
};

struct timInterruptCfg {
	TIM_TypeDef*					tim;
	const clkTimBaseCfg*			const cfg;
	uint32_t						countCfg;
};

class TimInterrupt : public TimInterruptBase {
public:
	TimInterrupt( const timInterruptCfg* const cfg );

	BASE_RESULT		reinit							( uint32_t numberCfg = 0 );

	BASE_RESULT		on								( void );
	void			off								( void );

	void			clearInterruptFlag				( void );

private:
	const timInterruptCfg*			const cfg;

	TIM_HandleTypeDef				tim;
};
